In [1]:
import pandas as pd

In [2]:
import numpy as np

In [50]:
df = pd.read_csv("./Mall_Customers.csv")

In [51]:
df

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for
a dataset (age, income etc.) with numeric variables grouped by one of the qualitative
(categorical) variable. For example, if your categorical variable is age groups and
quantitative variable is income, then provide summary statistics of income grouped by
the age groups. Create a list that contains a numeric value for each response to the
categorical variable.

This will compute the mean for only the numeric columns in your DataFrame, excluding columns like 'Genre'.

In [53]:
df.select_dtypes(include='number').mean()

CustomerID                100.50
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [55]:
df["Age"].mean()

np.float64(38.85)

The code df.loc[:, 'Age'].mean() calculates the mean (average) of the values in the Age column of the DataFrame df.

In [56]:
df.loc[:,'Age'].mean()

np.float64(38.85)

In [57]:
df.loc[:,'CustomerID'].mean()

np.float64(100.5)

df.mean(axis=1): This calculates the mean of each row. The axis=1 argument tells pandas to perform the operation along the horizontal axis (i.e., row-wise).

[0:4]: This selects the first 4 values of the resulting series, which corresponds to the means of the first 4 rows.

In [59]:
df.select_dtypes(include='number').mean(axis=1)[0:4]

0    18.50
1    29.75
2    11.25
3    30.00
dtype: float64

In [61]:
df.select_dtypes(include='number').median()

CustomerID                100.5
Age                        36.0
Annual Income (k$)         61.5
Spending Score (1-100)     50.0
dtype: float64

In [63]:
df.select_dtypes(include='number').median(axis=1) [0:4]

0    17.0
1    18.0
2    11.0
3    19.5
dtype: float64

In [64]:
df.loc[:,'CustomerID'].median()

np.float64(100.5)

In [65]:
df.mode()

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0             1  Female  32.0                54.0                    42.0
1             2     NaN   NaN                78.0                     NaN
2             3     NaN   NaN                 NaN                     NaN
3             4     NaN   NaN                 NaN                     NaN
4             5     NaN   NaN                 NaN                     NaN
..          ...     ...   ...                 ...                     ...
195         196     NaN   NaN                 NaN                     NaN
196         197     NaN   NaN                 NaN                     NaN
197         198     NaN   NaN                 NaN                     NaN
198         199     NaN   NaN                 NaN                     NaN
199         200     NaN   NaN                 NaN                     NaN

[200 rows x 5 columns]

In [66]:
df.loc[:,'CustomerID'].mode()

0        1
1        2
2        3
3        4
4        5
      ...
195    196
196    197
197    198
198    199
199    200
Name: CustomerID, Length: 200, dtype: int64

In [67]:
df.loc[:,'Age'].mode()

0    32
Name: Age, dtype: int64

In [68]:
df.max()

CustomerID                 200
Genre                     Male
Age                         70
Annual Income (k$)         137
Spending Score (1-100)      99
dtype: object

skipna=False: By default, max() skips NaN values when calculating the maximum. Setting skipna=False means that it does not ignore NaN values and will return NaN if the column contains any missing values (NaN).

In [69]:
df.loc[:,'Age'].max(skipna = False)

np.int64(70)

In [70]:
df.min()

CustomerID                     1
Genre                     Female
Age                           18
Annual Income (k$)            15
Spending Score (1-100)         1
dtype: object

In [71]:
df.loc[:,'Age'].min(skipna = False)

np.int64(18)

In [73]:
df.select_dtypes(include='number').std()

CustomerID                57.879185
Age                       13.969007
Annual Income (k$)        26.264721
Spending Score (1-100)    25.823522
dtype: float64

In [74]:
df.loc[:,'Age'].std()

np.float64(13.96900733155888)

In [75]:
df.loc[:,'Annual Income (k$)'].std()

np.float64(26.264721165271244)

std() calculates the standard deviation along columns (axis=0), but here you specify axis=1 to calculate it across rows.

In [77]:
df.select_dtypes(include='number').std(axis=1)[0:4]

0    15.695010
1    35.074920
2     8.057088
3    32.300671
dtype: float64

In [78]:
df

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [79]:
df.groupby(['Genre']) ['Age'].mean()

Genre
Female    38.098214
Male      39.806818
Name: Age, dtype: float64

In [84]:
df_u=df.rename(columns= {'Annual Income (k$)':'Income'},inplace=False)
df_u

     CustomerID   Genre  Age  Income  Spending Score (1-100)
0             1    Male   19      15                      39
1             2    Male   21      15                      81
2             3  Female   20      16                       6
3             4  Female   23      16                      77
4             5  Female   31      17                      40
..          ...     ...  ...     ...                     ...
195         196  Female   35     120                      79
196         197  Female   45     126                      28
197         198    Male   32     126                      74
198         199    Male   32     137                      18
199         200    Male   30     137                      83

[200 rows x 5 columns]

In [87]:
from sklearn import preprocessing

One-Hot Encoder is a technique used to convert categorical data into a numeric format suitable for machine learning models.

In [88]:
enc = preprocessing.OneHotEncoder()

creates a DataFrame of one-hot encoded values for the 'Genre' column.
enc.fit_transform(...) fits and transforms the 'Genre' column.
.toarray() converts the result (a sparse matrix) into a NumPy array.
pd.DataFrame(...) turns that array into a pandas DataFrame.

In [93]:
enc_df = pd.DataFrame(enc.fit_transform(df[['Genre']]).toarray())

In [95]:
enc_df

       0    1
0    0.0  1.0
1    0.0  1.0
2    1.0  0.0
3    1.0  0.0
4    1.0  0.0
..   ...  ...
195  1.0  0.0
196  1.0  0.0
197  0.0  1.0
198  0.0  1.0
199  0.0  1.0

[200 rows x 2 columns]

In [96]:
df_encode =df_u.join(enc_df)

In [97]:
df_encode

     CustomerID   Genre  Age  Income  Spending Score (1-100)    0    1
0             1    Male   19      15                      39  0.0  1.0
1             2    Male   21      15                      81  0.0  1.0
2             3  Female   20      16                       6  1.0  0.0
3             4  Female   23      16                      77  1.0  0.0
4             5  Female   31      17                      40  1.0  0.0
..          ...     ...  ...     ...                     ...  ...  ...
195         196  Female   35     120                      79  1.0  0.0
196         197  Female   45     126                      28  1.0  0.0
197         198    Male   32     126                      74  0.0  1.0
198         199    Male   32     137                      18  0.0  1.0
199         200    Male   30     137                      83  0.0  1.0

[200 rows x 7 columns]

2. Write a Python program to display some basic statistical details like percentile, mean,
standard deviation etc. of the species of â€˜Iris-setosaâ€™, â€˜Iris-versicolorâ€™ and â€˜Iris-
versicolorâ€™ of iris.csv dataset.

In [102]:
iris=pd.read_csv("./Iris.csv")

In [103]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

creates a boolean Series that checks whether each value in the 'species' column of the iris DataFrame is 'Iris-setosa'.

In [108]:
irisSet = (iris['Species']== 'Iris-setosa')
irisSet

0       True
1       True
2       True
3       True
4       True
       ...
145    False
146    False
147    False
148    False
149    False
Name: Species, Length: 150, dtype: bool

print(iris[irisSet].describe()) prints descriptive statistics for only the rows in the Iris dataset where the species is 'Iris-setosa'.

In [110]:
print(iris[irisSet].describe())

             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

In [112]:
irisVer = (iris['Species']== 'Iris-versicolor')

In [114]:
irisVer

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: Species, Length: 150, dtype: bool

In [115]:
print(iris[irisVer].describe())

              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

In [116]:
irisVir = (iris['Species']== 'Iris-virginica')

In [117]:
print(iris[irisVir].describe())

              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000